/* 
====================================================
-- 004 - Install Visual Studio And Answer Questions 
-- link : https://youtu.be/RWtT07Id-n4
==================================================

*/

/*
محتوى الفيديو
الفيديو يحتوي على مجموعة من الأسئلة وإجاباتها وكذلك تحميل برنامج Visual Studio Community

    في إضافات تسهل عليا الأمور شوية ؟
    في مشكلة لو اخترت أي برنامج تاني غير VS Code ?
    ليه بنشيء بيئة العمل بنفسي ؟
    هل لازم أفهم الفيديو من أول مرة ؟
    هل كل مرة هعمل الخطوات دي كدة بعد متعلم ؟
    في مشكلة لو اتعلمت اونلاين بدون برامج ؟
    أعمل ايه في المصطلحات الإنجليزية اللي بسمعها في الفيديو ؟
    هل كل فترة هنجاوب على أسئلة الكورس ؟

*/