// التكليف 01

//    لدينا البيانات التالية والمطلوب بجانب كل بيان منهم أن تضع تعليق فيه إسم نوع البيانات بالنسبة للغة
// C++
//    قم بكتابة نوع البيانات وبجانبه سهم وتوضح إسم هذا النوع. شاهد المثال لتفهم الفكرة

// Example
// false // bool => Boolean

// 'a'
// '9'
// 9
// true
// 100
// -10
// 0
// false
// 10.9

// ===================================================================================================
// solution

// 'a'      char => characters
// '9'      char => characters
// 9        int => integer
// true     bool => Boolean
// 100      int => integer
// -10      int => integer
// 0        int => integer
// false    bool => Boolean
// 10.9     flot
